---
kind: method
id: M:Autodesk.Revit.DB.ViewSheetSetting.Revert
source: html/2bd893e6-ca59-b6fe-0a5a-55a630f8b123.htm
---
# Autodesk.Revit.DB.ViewSheetSetting.Revert Method

Revert the current view sheet set.

## Syntax (C#)
```csharp
public void Revert()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the current view sheet set is In-Session.